export default {

  "test": {
    "hello": "สวัสดี ชาวโลก!!"
  },

  "navbar": {
    "reportweb": "รายงานเว็บไซต์มิจฉาชีพ",
    "verifyweb": "ตรวจสอบลิงค์เว็บไซต์",
    "signin": "เข้าสู่ระบบ",
    "signup": "ลงทะเบียน"
  },

  "signinpage": {
    "signin": "เข้าสู่ระบบ",
    "signup": "ลงทะเบียน",
    "username": "บัญชีผู้ใช้",
    "text1": "ใส่ บัญชีผู้ใช้, เบอร์โทร หรือ gmail ของคุณ",
    "text2": "ใส่ รหัสผ่าน ของคุณ",
    "password": "รหัสผ่าน",
    "signupmes": "หากยังไม่มีบัญชีผู้ใช้ คลิกที่นี้"
  },

  "signuppage": {
    "title": "สร้างบัญชีผู้ใช้",
    "signup": "ลงทะเบียน",
    "username": "ชื่อผู้ใช้",
    "usertext": "ใส่ชื่อผู้ใช้ของคุณ",
    "email": "Gmail",
    "emtext": "ใส่ gmail ของคุณ",
    "phonenum": "เบอร์ติดต่อ (ทางเลือก)",
    "phntext": "ใส่เบอร์ติดต่อของคุณ",
    "password": "รหัสผ่าน",
    "pwtext": "ใส่รหัสผ่านของคุณ",
    "confirm": "ยืนยันรหัสผ่าน",
    "cftext": "ยืนยันรหัสผ่านของคุณ",
    "consent1": "กรุณาอ่าน",
    "termofuse": "Terms of Use",
    "and": "และ",
    "privacypolicy": "Privacy Policy",
    "consent2": "เพื่ออนุญาตให้เราเก็บข้อมูลของคุณ",
    "errconfirmpass": "รหัสผ่าน และ รหัสยืนยันควรเหมือนกัน",
    "successmsg": "ตรวจสอบข้อมูลสำเร็จ",
    "erremail": "รูปแบบของอีเมล์ผิด",
    "errpw1": "รหัสผ่านต้องการอย่างน้อย 8 ตัวอักษร",
    "errpw2": "รหัสผ่านต้องการตัวเลขอย่างน้อย 1 ตัวอักษร",
    "errphone": "โปรดใส่หมายเลขโทรศัพท์ให้ถูกต้อง",
    "errconsent": "โปรดอ่านและยอมรับข้อกำหนด",
  },

  "termofusepage": {
    "title": "Term of use"
  },

  "privacypolicypage": {
    "title": "Privacy Policy"
  },

  "homepage": {
    "title": "เริ่มต้นตรวจสอบลิงค์เว็บไซต์ เพื่อความปลอดภัยของคุณ",
    "caption": "ใส่ลิงค์ของคุณในช่องตรวจสอบ เพื่อตรวจสอบเว็บไซต์ที่คุณใช้ และเพื่อเช็คเปอร์เซ็นความเป็นเว็บไซต์มิจฉาชีพเทียบกับฐานข้อมูลประวัติอาชญากรรม",
    "text": "ใส่ลิงค์ตรงนี้",
    "verify": "ค้นหา",
    "rank": "จัดอันดับลิงค์มิจฉาชีพ",
    "detail": "รายละเอียด",
    "category": "ประเภท",
    "reportnum": "จำนวนการแจ้ง",
    "more": "เพิ่มเติม"
  },

  "detailpage": {
    "title": "รายละเอียดเว็บไซต์อาชญากรรม",
    "category": "ประเภท",
    "gambling": "พนัน รายงาน",
    "scam": "หลอกลวง รายงาน",
    "fake": "ปลอมแปลง รายงาน",
    "other": "อื่นๆ รายงาน",
    "searchtext": "ค้นหาคำ",
    "searchbutt": "ค้นหา",
    "detail": "รายละเอียด",
    "bank": "บัญชีธนาคาร",
    "more": "ดูเพิ่มเติม"
  },

  "report": {
    "title": "เริ่มต้นรายงานลิงค์เว็บไซต์ผิดกฎหมาย",
    "caption": "กรุณา Sign in หรือ Sign up ก่อนการรายงานข้อมูล เพื่อความแม่นยำของข้อมูลของคุณ",
    "signin": "เข้าสู่ระบบ",
    "signup": "ลงทะเบียน",
  },

  "profilepage": {
    "title": "โปรไฟล์ของฉัน",
    "username": "ชื่อผู้ใช้",
    "gmail": "Gmail",
    "phonenum": "เบอร์ติดต่อ (ทางเลือก)",
    "password": "รหัสผ่าน",
  },

  "verificationpage": {
    "title": "เริ่มต้นตรวจสอบลิงค์เว็บไซต์ เพื่อความปลอดภัยของคุณ",
    "caption": "ใส่ลิงค์ของคุณในช่องตรวจสอบ เพื่อตรวจสอบเว็บไซต์ที่คุณใช้และเพื่อเช็คเปอร์เซ็นความเป็นเว็บไซต์มิจฉาชีพเทียบกับฐานข้อมูลประวัติอาชญากรรม",
    "url-detection-title": "ตรวจสอบ URL",
    "analysis-title": "AI ตรวจสอบเปอร์เซ็นความเสี่ยง",
    "analysis-subtitle": "ค่าเปอร์เซ็นมากสุดที่เคยวิเคราะห์ได้",
    'update': "อัพเดทปัจจุบัน",
    'readmore': "อ่านรายละเอียดเว็บไซต์เพิ่มเติมที่นี่",
    'malicious-url': "Malicious URL Detection"
  },

  "moredetailpage": {
    "title": "รายละเอียด URL เพิ่มเติม",
    "risk-score": "เปอร์เซ็นความเสี่ยง:",
    "measurement": "เกณฑ์การวัดความน่าเชื่อถือ",
    "websiteinsight-title": "ข้อมูลเชิงลึกของเว็บไซต์",
    "API-title": "เปรียบเทียบ API กับเว็บไซต์ตรวจสอบเว็บโกงอื่นๆ",
    "API-website-col": "เว็บไซต์ตรวจสอบเว็บโกง", 
    "API-inspection-result-col": "ผลการตรวจสอบ",
    "low": "ต่ำ",
    "quite-low": "ค่อนข้างต่ำ",
    "quite-high": "ค่อนข้างสูง",
    "high": "สูง",
    "FOUND": "ค้นพบ",
    "NOT FOUND": "ไม่พบ",
    "No Result": "ไม่มีผลลัพธ์ดังกล่าว"
  },
}