export default {

  "test": {
    "hello": "สวัสดี ชาวโลก!!"
  },

  "navbar": {
    "reportweb": "รายงานเว็บไซต์",
    "verifyweb": "ตรวจสอบลิงค์เว็บไซต์",
    "signin": "เข้าสู่ระบบ",
    "signup": "ลงทะเบียน",
    "signout": "ออกจากระบบ",
    "TH": "ไทย",
    "EN": "อังกฤษ"
  },

  "signinpage": {
    "signin": "เข้าสู่ระบบ",
    "signup": "ลงทะเบียน",
    "username": "บัญชีผู้ใช้",
    "text1": "ใส่บัญชีผู้ใช้",
    "text2": "กรอกรหัสผ่านของคุณอย่างน้อย 8 ตัวอักษรพร้อมตัวเลข",
    "password": "รหัสผ่าน",
    "signupmes": "หากยังไม่มีบัญชีผู้ใช้ คลิกที่นี่เพื่อ"
  },

  "signuppage": {
    "title": "สร้างบัญชีผู้ใช้",
    "signup": "ลงทะเบียน",
    "signin": "เข้าสู่ระบบ",
    "have": "มีข้อมูลผู้ใช้อยู่แล้ว?",
    "username": "ชื่อผู้ใช้",
    "usertext": "ใส่ชื่อผู้ใช้ของคุณ",
    "email": "Email",
    "emtext": "ใส่ Email ของคุณ",
    "phonenum": "เบอร์ติดต่อ (ทางเลือก)",
    "phntext": "ใส่เบอร์ติดต่อของคุณ ตัวอย่าง(0897654321)",
    "password": "รหัสผ่าน",
    "pwtext": "กรอกรหัสผ่านของคุณอย่างน้อย 8 ตัวอักษรพร้อมตัวเลข",
    "confirm": "ยืนยันรหัสผ่าน",
    "cftext": "ยืนยันรหัสผ่านของคุณ",
    "consent1": "กรุณาอ่าน",
    "termofuse": "ข้อกำหนดการใช้งาน",
    "and": "และ",
    "privacypolicy": "นโยบายความเป็นส่วนตัว",
    "consent2": "เพื่ออนุญาตให้เราเก็บข้อมูลของคุณ",
    "errconfirmpass": "รหัสผ่าน และ รหัสยืนยันควรเหมือนกัน",
    "successmsg": "ตรวจสอบข้อมูลสำเร็จ",
    "erremail": "รูปแบบของอีเมล์ผิด",
    "errpw1": "รหัสผ่านต้องการอย่างน้อย 8 ตัวอักษร",
    "errpw2": "รหัสผ่านต้องการตัวเลขอย่างน้อย 1 ตัวอักษร",
    "errphone": "โปรดใส่หมายเลขโทรศัพท์ให้ถูกต้อง",
    "errconsent": "โปรดอ่านและยอมรับข้อกำหนด",
    "warntext": "*หมายเหตุ* ชื่อผู้ใช้จะใช้ในการเข้าสู่ระบบและแสดงการรายงาน",
    "errfield": "โปรดระบุข้อมูลลงในช่องนี้",
    "AItxt1": "(ทางเลือก) ปุ่ม AI สุ่มชื่อผู้ใช้",
    "AItxt2": "ตัวสุ่มชื่อ",
  },

  "termofusepage": {
    "title": "เงื่อนไขการใช้บริการ",
    "accept": "ฉันยอมรับ",

    "generaltermtitle": "เงื่อนไขทั่วไป",
    "generaltermtxt1": `การเข้าใช้งาน Thai.CheckLinks แสดงถึงการยืนยันว่า
    คุณตกลงและผูกพันตามเงื่อนไขการใช้งานที่มีอยู่ในข้อกำหนดและเงื่อนไขที่ระบุไว้ด้านล่าง ข้อกำหนดเหล่านี้ใช้กับ
    เว็บไซต์ทั้งหมดและการสื่อสารใด ๆ ระหว่างคุณกับ Thai.CheckLinks`,

    "generaltermtxt2": ` ภายใต้สิ่งที่เราได้ระบุไว้ในเงื่อนไขและข้อกำหนดด้านล่างนี้ ทีมงานของ Thai.CheckLinks จะไม่รับผิดชอบ
    ต่อความเสียหายโดยตรง, รวมถึงการสูญเสียข้อมูลหรือกำไร, ที่เกิดขึ้นจากการใช้หรือไม่สามารถใช้เนื้อหาใน
    เว็บไซต์นี้ได้, แม้ว่าทีมงานของ Thai.CheckLinks หรือตัวแทนที่ได้รับอนุญาตจะได้รับการแจ้งเกี่ยวกับความ
    เป็นไปได้เช่นนั้นไว้ หากการใช้เนื้อหาจากเว็บไซต์นี้ทำให้เกิดความต้องการในการบำรุงรักษา ซ่อมแซมหรือ
    แก้ไขข้อมูล คุณต้องรับผิดชอบค่าใช้จ่ายทั้งหมดนั้นเอง`,

    "generaltermtxt3": `  Thai.CheckLinks จะไม่รับผิดชอบต่อผลลัพธ์ใด ๆ ที่อาจเกิดขึ้นระหว่างการใช้ทรัพยากรของเรา เราขอสงวนสิทธิ์
    ในการเปลี่ยนแปลงราคาและการแก้ไขนโยบายการใช้ทรัพยากรได้ทุกเมื่อ`,

    "license": "ใบอนุญาต",
    "licensetxt": `Thai.CheckLinks มอบสิทธิ์การใช้งานแบบจำกัดที่สามารถเพิกถอนได้ ไม่ผูกขาด
     ไม่สามารถถ่ายโอนได้ และจำกัดแก่คุณในการดาวน์โหลด ติดตั้ง และใช้เว็บไซต์อย่างเคร่งครัดตามข้อกำหนด
     ของข้อตกลงนี้ ข้อกำหนดและเงื่อนไขเหล่านี้เป็นสัญญาระหว่างคุณกับ Thai.CheckLinks`,

    // Definitions and key terms
    "definition": "คำจำกัดความและคำศัพท์สำคัญ",
    "deftxt1": "สำหรับข้อกำหนดและเงื่อนไขนี้:",
    "deftxt2": `คุกกี้: ข้อมูลจำนวนเล็กน้อยที่สร้างโดยเว็บไซต์และบันทึกโดยเว็บเบราว์เซอร์ของคุณ มันถูกใช้เพื่อระบุเบราว์เซอร์ของคุณ จัดทำการวิเคราะห์ และจดจำข้อมูลเกี่ยวกับคุณ เช่น การตั้งค่าภาษาของคุณ หรือข้อมูลการเข้าสู่ระบบ`,
    "deftxt3": `บริษัท: เมื่อนโยบายนี้กล่าวถึง "บริษัท" "เรา" "พวกเรา" หรือ "ของเรา" จะหมายถึง Thai.CheckLinks ซึ่งรับผิดชอบข้อมูลของคุณภายใต้นโยบายความเป็นส่วนตัวนี้`,
    "deftxt4": `ประเทศ: ซึ่ง Thai.CheckLinks หรือเจ้าของ/ผู้ก่อตั้ง Thai.CheckLinks ตั้งอยู่ ในกรณีนี้คือ ประเทศไทย`,
    "deftxt5": `ลูกค้า: หมายถึงบริษัท องค์กร หรือบุคคลที่สมัครใช้บริการ Thai.CheckLinks เพื่อจัดการความสัมพันธ์กับผู้บริโภคหรือผู้ใช้บริการของคุณ`,
    "deftxt6": `อุปกรณ์: อุปกรณ์ที่เชื่อมต่ออินเทอร์เน็ต เช่น โทรศัพท์ แท็บเล็ต คอมพิวเตอร์ หรืออุปกรณ์อื่นใดที่สามารถใช้เพื่อเยี่ยมชม Thai.CheckLinks และใช้บริการได้`,
    "deftxt7": `ที่อยู่ IP: อุปกรณ์ทุกเครื่องที่เชื่อมต่อกับอินเทอร์เน็ตจะได้รับการกำหนดหมายเลขที่เรียกว่าที่อยู่อินเทอร์เน็ตโปรโตคอล (IP) โดยปกติแล้วหมายเลขเหล่านี้จะถูกกำหนดไว้ในบล็อกทางภูมิศาสตร์ ที่อยู่ IP มักจะใช้เพื่อระบุตำแหน่งที่อุปกรณ์เชื่อมต่อกับอินเทอร์เน็ต`,
    "deftxt8": `ข้อมูลส่วนบุคคล: ข้อมูลใดๆ ที่โดยตรง โดยอ้อม หรือเกี่ยวข้องกับข้อมูลอื่นๆ — รวมถึงหมายเลขประจำตัวส่วนบุคคล — ช่วยให้สามารถระบุตัวตนหรือระบุตัวบุคคลได้`,
    "deftxt9": `บริการ: หมายถึงบริการที่ Thai.CheckLinks มอบให้ตามที่อธิบายไว้ในข้อกำหนดที่เกี่ยวข้อง (ถ้ามี) และบนแพลตฟอร์มนี้`,
    "deftxt10": `บริการของบุคคลที่สาม: หมายถึงผู้ลงโฆษณา ผู้สนับสนุนการแข่งขัน พันธมิตรด้านการส่งเสริมการขายและการตลาด และบุคคลอื่น ๆ ที่ให้เนื้อหาของเราหรือผลิตภัณฑ์หรือบริการที่เราคิดว่าคุณอาจสนใจ`,
    "deftxt11": `เว็บไซต์: เว็บไซต์ของ Thai.CheckLinks ซึ่งสามารถเข้าถึงได้ผ่าน URL นี้: www.thaiscamlinks.com.`,
    "deftxt12": `คุณ: บุคคลหรือนิติบุคคลที่ลงทะเบียนกับ Thai.CheckLinks เพื่อใช้บริการ`,

    // Restrictions
    "restrictions": "ข้อจำกัด",
    "restxt1": "คุณตกลงที่จะไม่ทำ และคุณจะไม่อนุญาตให้ผู้อื่นทำเช่นนั้น",
    "restxt2": `อนุญาต ขาย ให้เช่า ให้เช่าซื้อ มอบหมาย แจกจ่าย ส่ง โฮสต์ ว่าจ้างบุคคลภายนอก เปิดเผย หรือใช้ประโยชน์จากบริการในเชิงพาณิชย์หรือทำให้แพลตฟอร์มพร้อมใช้งานสำหรับบุคคลที่สาม`,
    "restxt3": `แก้ไข สร้างผลงานลอกเลียนแบบ แยกส่วน ถอดรหัส คอมไพล์ย้อนกลับ หรือทำวิศวกรรมย้อนกลับส่วนหนึ่งส่วนใดของบริการ`,
    "restxt4": `แก้ไข สร้างผลงานลอกเลียนแบบ แยกส่วน ถอดรหัส คอมไพล์ย้อนกลับ หรือทำวิศวกรรมย้อนกลับส่วนหนึ่งส่วนใดของบริการ`,

    // Suggest
    "suggest": "ข้อเสนอแนะของคุณ",
    "sugtxt1": `ข้อเสนอแนะ ความคิดเห็น แนวคิด การปรับปรุง หรือข้อเสนอแนะ (เรียกรวมกันว่า "คำแนะนำ") ที่คุณให้กับเราเกี่ยวกับบริการจะยังคงเป็นทรัพย์สินของเราแต่เพียงผู้เดียว เราจะมีอิสระในการใช้ คัดลอก แก้ไข เผยแพร่ หรือแจกจ่ายข้อเสนอแนะเพื่อวัตถุประสงค์ใดๆ และในทางใดๆ โดยไม่มีเครดิตหรือค่าตอบแทนใดๆ แก่คุณ`,

    // consent
    "consent": "ความยินยอมของคุณ",
    "contxt1": `เราได้อัปเดตข้อกำหนดและเงื่อนไขของเราเพื่อให้คุณมีความโปร่งใสอย่างสมบูรณ์เกี่ยวกับสิ่งที่ถูกกำหนดไว้เมื่อคุณเยี่ยมชมไซต์ของเรา และวิธีการใช้งาน โดยการใช้บริการของเราหรือการลงทะเบียนบัญชี แสดงว่าคุณยินยอมตามข้อกำหนดและเงื่อนไขของเรา`,

    // Modifications to Our Service
    "mod": "การแก้ไขบริการของเรา",
    "modtxt1": `เราขอสงวนสิทธิ์ในการแก้ไข ระงับ หรือยุติบริการหรือบริการใด ๆ ที่เชื่อมต่ออยู่ชั่วคราวหรือถาวร โดยมีหรือไม่มีการแจ้งให้ทราบล่วงหน้า และไม่ต้องรับผิดต่อคุณ`,

    // Updates to Our Service
    "update": "อัปเดตบริการของเรา",
    "updatetxt": `เราอาจจัดให้มีการปรับปรุงหรือปรับปรุงคุณสมบัติ/ฟังก์ชันการทำงานของบริการเป็นครั้งคราว ซึ่งอาจรวมถึงแพทช์ การแก้ไขข้อบกพร่อง การอัปเดต การอัพเกรด และการแก้ไขอื่นๆ ("การอัปเดต") การอัพเดตอาจแก้ไขหรือลบคุณสมบัติและ/หรือฟังก์ชันบางอย่างของบริการ คุณยอมรับว่าเราไม่มีข้อผูกมัดที่จะต้อง (i) จัดให้มีการอัปเดตใดๆ หรือ (ii) จัดให้มีหรือเปิดใช้งานคุณลักษณะเฉพาะและ/หรือฟังก์ชันการทำงานใดๆ ของบริการแก่คุณต่อไป คุณตกลงเพิ่มเติมว่าการอัปเดตทั้งหมดจะ (i) ถือว่าเป็นส่วนหนึ่งของบริการ และ (ii) อยู่ภายใต้ข้อกำหนดและเงื่อนไขของข้อตกลงนี้`,

    // Third-Party Services
    "third": "บริการของบุคคลที่สาม",
    "thirdtxt1": `เราอาจแสดง รวม หรือจัดให้มีเนื้อหาของบุคคลที่สาม (รวมถึงข้อมูล ข่าวสาร แอปพลิเคชัน และผลิตภัณฑ์และบริการอื่น ๆ) หรือให้ลิงก์ไปยังเว็บไซต์หรือบริการของบุคคลที่สาม ("บริการของบุคคลที่สาม") . คุณรับทราบและยอมรับว่าเราจะไม่รับผิดชอบต่อบริการของบุคคลที่สาม รวมถึงความถูกต้อง ความสมบูรณ์ ความทันเวลา ความถูกต้อง การปฏิบัติตามลิขสิทธิ์ ความถูกต้องตามกฎหมาย ความเหมาะสม คุณภาพ หรือแง่มุมอื่นใด เราไม่ยอมรับและจะไม่มีความรับผิดหรือความรับผิดชอบใด ๆ ต่อคุณหรือบุคคลหรือนิติบุคคลอื่นใดสำหรับบริการของบุคคลที่สาม บริการและลิงก์ของบุคคลที่สามมีไว้เพื่ออำนวยความสะดวกให้กับคุณเท่านั้น และคุณเข้าถึงและใช้บริการทั้งหมดด้วยความเสี่ยงของคุณเองและอยู่ภายใต้ข้อกำหนดและเงื่อนไขของบุคคลที่สามดังกล่าว`,

    // Links to Other Websites
    "link": "ลิงก์ไปยังเว็บไซต์อื่น",
    "linktxt": `บริการของเราอาจมีลิงก์ไปยังเว็บไซต์อื่น ๆ ที่ไม่ได้ดำเนินการโดยเรา หากคุณคลิกลิงก์ของบุคคลที่สาม คุณจะถูกนำไปยังไซต์ของบุคคลที่สามนั้น เราขอแนะนำให้คุณตรวจสอบข้อกำหนดและเงื่อนไขของทุกเว็บไซต์ที่คุณเยี่ยมชม เราไม่สามารถควบคุมและไม่รับผิดชอบต่อเนื้อหา ข้อกำหนดและเงื่อนไข หรือแนวปฏิบัติของเว็บไซต์หรือบริการของบุคคลที่สาม`,

    // Cookies
    "cookies": "คุกกี้",
    "cookistxt": `เราใช้ "คุกกี้" เพื่อระบุพื้นที่ของเว็บไซต์ของเราที่คุณเคยเยี่ยมชม คุกกี้คือข้อมูลชิ้นเล็กๆ ที่เว็บเบราว์เซอร์ของคุณจัดเก็บไว้ในคอมพิวเตอร์หรืออุปกรณ์มือถือของคุณ เราใช้คุกกี้เพื่อปรับปรุงประสิทธิภาพและฟังก์ชันการทำงานของบริการของเรา แต่ไม่จำเป็นต่อการใช้งาน อย่างไรก็ตาม หากไม่มีคุกกี้เหล่านี้ ฟังก์ชันบางอย่างเช่นวิดีโออาจไม่พร้อมใช้งานหรือคุณจะต้องป้อนรายละเอียดการเข้าสู่ระบบทุกครั้งที่คุณเยี่ยมชมแพลตฟอร์มของเรา เนื่องจากเราจะจำไม่ได้ว่าคุณเคยเข้าสู่ระบบก่อนหน้านี้ เว็บเบราว์เซอร์ส่วนใหญ่สามารถตั้งค่าให้ปิดการใช้งานคุกกี้ได้ อย่างไรก็ตาม หากคุณปิดการใช้งานคุกกี้ คุณอาจไม่สามารถเข้าถึงฟังก์ชันการทำงานบนเว็บไซต์ของเราได้อย่างถูกต้องหรือไม่ได้เลย เราไม่เคยใส่ข้อมูลที่สามารถระบุตัวบุคคลได้ในคุกกี้ `,

    // Changes To Our Terms & Conditions
    "change": "การเปลี่ยนแปลงข้อกำหนดและเงื่อนไขของเรา",
    "changetxt": `คุณรับทราบและยอมรับว่าเราอาจหยุดให้บริการ (หรือคุณสมบัติใดๆ ภายในบริการ) (ถาวรหรือชั่วคราว) แก่คุณหรือผู้ใช้โดยทั่วไปตามดุลยพินิจของเราแต่เพียงผู้เดียว โดยไม่ต้องแจ้งให้คุณทราบล่วงหน้า คุณสามารถหยุดใช้บริการได้ตลอดเวลา คุณไม่จำเป็นต้องแจ้งให้เราทราบโดยเฉพาะเมื่อคุณหยุดใช้บริการ คุณรับทราบและยอมรับว่าหากเราปิดการเข้าถึงบัญชีของคุณ คุณอาจถูกป้องกันไม่ให้เข้าถึงบริการ รายละเอียดบัญชีของคุณ หรือไฟล์ใด ๆ หรือเนื้อหาอื่น ๆ ที่มีอยู่ในบัญชีของคุณ หากเราตัดสินใจที่จะเปลี่ยนแปลงข้อกำหนดและเงื่อนไขของเรา เราจะโพสต์การเปลี่ยนแปลงเหล่านั้นบนหน้านี้ และ/หรืออัปเดตวันที่แก้ไขข้อกำหนดและเงื่อนไขด้านล่าง`,

    // Term and Termination
    "termter": "ระยะเวลาและการสิ้นสุด",
    "termtertxt": `ข้อตกลงนี้จะยังคงมีผลบังคับจนกว่าคุณหรือเราจะยกเลิก เราอาจใช้ดุลยพินิจแต่เพียงผู้เดียวเมื่อใดก็ได้และด้วยเหตุผลใดก็ตามหรือไม่มีเหตุผลในการระงับหรือยกเลิกข้อตกลงนี้โดยมีหรือไม่มีการแจ้งให้ทราบล่วงหน้า ข้อตกลงนี้จะยุติทันทีโดยไม่ต้องแจ้งให้ทราบล่วงหน้าจากเรา ในกรณีที่คุณไม่ปฏิบัติตามข้อกำหนดใด ๆ ของข้อตกลงนี้ คุณยังอาจยุติข้อตกลงนี้ได้ด้วยการลบบริการและสำเนาทั้งหมดออกจากคอมพิวเตอร์ของคุณ เมื่อข้อตกลงนี้สิ้นสุดลง คุณจะต้องหยุดใช้บริการทั้งหมดและลบสำเนาของบริการทั้งหมดออกจากคอมพิวเตอร์ของคุณ การสิ้นสุดข้อตกลงนี้จะไม่จำกัดสิทธิ์หรือการเยียวยาใด ๆ ของเราตามกฎหมายหรือในส่วนของความยุติธรรมในกรณีที่คุณฝ่าฝืน (ในช่วงระยะเวลาของข้อตกลงนี้) ของภาระผูกพันใด ๆ ของคุณภายใต้ข้อตกลงปัจจุบัน`,
    "termtertxt2": `หากคุณเป็นเจ้าของลิขสิทธิ์หรือตัวแทนของเจ้าของดังกล่าว และเชื่อว่าเนื้อหาใดๆ จากเราถือเป็นการละเมิดลิขสิทธิ์ของคุณ โปรดติดต่อเราเพื่อแจ้งข้อมูลต่อไปนี้: (a) ลายเซ็นจริงหรืออิเล็กทรอนิกส์ของเจ้าของลิขสิทธิ์ หรือ บุคคลที่ได้รับอนุญาตให้กระทำการแทนตน (b) การระบุเนื้อหาที่ถูกอ้างว่าถูกละเมิด; (ค) ข้อมูลติดต่อของคุณ รวมถึงที่อยู่ หมายเลขโทรศัพท์ และอีเมลของคุณ (d) คำแถลงของคุณว่าคุณมีความเชื่อโดยสุจริตว่าการใช้เนื้อหาไม่ได้รับอนุญาตจากเจ้าของลิขสิทธิ์; และ (e) ข้อความว่าข้อมูลในการแจ้งเตือนนั้นถูกต้อง และภายใต้บทลงโทษของการเบิกความเท็จ คุณได้รับอนุญาตให้ดำเนินการในนามของเจ้าของ`,

    //Indemnification
    "indem": "การชดใช้ค่าเสียหาย",
    "indemtxt": `คุณตกลงที่จะชดใช้ค่าเสียหายและถือว่าเราและบริษัทแม่ บริษัทสาขา บริษัทในเครือ เจ้าหน้าที่ ลูกจ้าง ตัวแทน หุ้นส่วน และผู้อนุญาต (ถ้ามี) พ้นจากการเรียกร้องหรือการเรียกร้องใด ๆ รวมถึงค่าธรรมเนียมทนายความที่สมเหตุสมผล เนื่องจากหรือ เกิดขึ้นจาก: (a) การใช้บริการ; (b) การละเมิดข้อตกลงนี้หรือกฎหมายหรือข้อบังคับใด ๆ หรือ (c) การละเมิดสิทธิ์ใด ๆ ของบุคคลที่สาม`,

    // No Warranties
    "nowan": "ไม่มีการรับประกัน",
    "nowantxt": `บริการนี้มอบให้แก่คุณ "ตามสภาพ" และ "ตามที่มี" และมีข้อบกพร่องและข้อบกพร่องทั้งหมดโดยไม่มีการรับประกันใดๆ ตามขอบเขตสูงสุดที่ได้รับอนุญาตภายใต้กฎหมายที่บังคับใช้ เราในนามของเราเองและในนามของบริษัทในเครือของเราและผู้อนุญาตและผู้ให้บริการที่เกี่ยวข้องของเรา ขอปฏิเสธการรับประกันทั้งหมดโดยชัดแจ้ง ไม่ว่าจะโดยชัดแจ้ง โดยนัย ตามกฎหมายหรืออย่างอื่น ที่เกี่ยวข้องกับบริการ รวมถึงการรับประกันโดยนัยทั้งหมดเกี่ยวกับความสามารถเชิงพาณิชย์ ความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ กรรมสิทธิ์ และการไม่ละเมิด และการรับประกันที่อาจเกิดขึ้นจากข้อตกลง แนวทางการปฏิบัติงาน การใช้งาน หรือแนวปฏิบัติทางการค้า โดยไม่มีข้อจำกัดที่กล่าวมาข้างต้น เราไม่รับประกันหรือดำเนินการใดๆ และไม่มีการรับรองใดๆ ว่าบริการจะตรงตามความต้องการของคุณ บรรลุผลตามที่ตั้งใจไว้ สามารถเข้ากันได้หรือทำงานร่วมกับซอฟต์แวร์ เว็บไซต์ ระบบ หรือบริการอื่นใด ดำเนินการ โดยไม่หยุดชะงัก เป็นไปตามมาตรฐานประสิทธิภาพหรือความน่าเชื่อถือใดๆ หรือปราศจากข้อผิดพลาด หรือข้อผิดพลาดหรือข้อบกพร่องใดๆ สามารถหรือจะได้รับการแก้ไข`,
    "nowantxt2": `โดยไม่จำกัดสิ่งที่กล่าวมาข้างต้น ทั้งเราและผู้ให้บริการรายใดไม่ได้เป็นตัวแทนหรือรับประกันใด ๆ ทั้งโดยชัดแจ้งหรือโดยนัย: (i) เกี่ยวกับการดำเนินการหรือความพร้อมของบริการ หรือข้อมูล เนื้อหา และวัสดุหรือ ผลิตภัณฑ์ที่รวมอยู่ในนั้น (ii) บริการจะไม่หยุดชะงักหรือปราศจากข้อผิดพลาด; (iii) เกี่ยวกับความถูกต้อง ความน่าเชื่อถือ หรือสกุลเงินของข้อมูลหรือเนื้อหาใดๆ ที่ให้ผ่านบริการ; หรือ (iv) บริการ เซิร์ฟเวอร์ เนื้อหา หรืออีเมลที่ส่งจากหรือในนามของเราปราศจากไวรัส สคริปต์ ม้าโทรจัน เวิร์ม มัลแวร์ ไทม์บอมบ์ หรือส่วนประกอบที่เป็นอันตรายอื่น ๆ เขตอำนาจศาลบางแห่งไม่อนุญาตให้มีการยกเว้นหรือข้อจำกัดในการรับประกันโดยนัยหรือข้อจำกัดเกี่ยวกับสิทธิ์ตามกฎหมายที่เกี่ยวข้องของผู้บริโภค ดังนั้นข้อยกเว้นและข้อจำกัดข้างต้นบางส่วนหรือทั้งหมดอาจไม่มีผลกับคุณ`,

    // Limitation of Liability
    "limit": "ข้อจำกัดความรับผิด",
    "limittxt": `โดยไม่คำนึงถึงความเสียหายใดๆ ที่คุณอาจได้รับ ความรับผิดทั้งหมดของเราและซัพพลายเออร์ของเราภายใต้ข้อกำหนดใดๆ ของข้อตกลงนี้ และการเยียวยาเฉพาะของคุณสำหรับสิ่งที่กล่าวมาทั้งหมดจะถูกจำกัดอยู่ที่จำนวนเงินที่คุณจ่ายจริงสำหรับ บริการ. ตามขอบเขตสูงสุดที่กฎหมายที่บังคับใช้อนุญาต ไม่ว่าในกรณีใดเราหรือซัพพลายเออร์ของเราจะไม่รับผิดชอบต่อความเสียหายพิเศษ ความเสียหายโดยบังเอิญ ทางอ้อม หรือที่เป็นผลสืบเนื่องใดๆ ก็ตาม (รวมถึงแต่ไม่จำกัดเพียง ความเสียหายจากการสูญเสียผลกำไร การสูญเสียข้อมูล หรือ ข้อมูลอื่น ๆ สำหรับการหยุดชะงักทางธุรกิจ สำหรับการบาดเจ็บส่วนบุคคล สำหรับการสูญเสียความเป็นส่วนตัวที่เกิดขึ้นจากหรือในทางใด ๆ ที่เกี่ยวข้องกับการใช้หรือการไม่สามารถใช้บริการ ซอฟต์แวร์ของบุคคลที่สาม และ/หรือฮาร์ดแวร์ของบุคคลที่สามที่ใช้กับบริการ หรือเกี่ยวข้องกับข้อกำหนดใด ๆ ของข้อตกลงนี้) แม้ว่าเราหรือซัพพลายเออร์รายใดจะได้รับคำแนะนำถึงความเป็นไปได้ของความเสียหายดังกล่าว และแม้ว่าการเยียวยาจะล้มเหลวตามวัตถุประสงค์ที่สำคัญก็ตาม รัฐ/เขตอำนาจศาลบางแห่งไม่อนุญาตให้มีข้อยกเว้นหรือข้อจำกัดของความเสียหายโดยบังเอิญหรือที่เป็นผลสืบเนื่อง ดังนั้นข้อจำกัดหรือข้อยกเว้นข้างต้นอาจไม่มีผลกับคุณ`,

    // Severability
    "sever": "การแยกส่วน",
    "severtxt": `หากข้อกำหนดใดๆ ของข้อตกลงนี้ถือว่าไม่สามารถบังคับใช้ได้หรือไม่ถูกต้อง ข้อกำหนดดังกล่าวจะถูกเปลี่ยนแปลงและตีความเพื่อให้บรรลุวัตถุประสงค์ของข้อกำหนดดังกล่าวในขอบเขตสูงสุดที่เป็นไปได้ภายใต้กฎหมายที่บังคับใช้ และข้อกำหนดที่เหลือจะยังคงมีผลใช้บังคับอย่างเต็มที่ และผลกระทบ`,
    "severtxt2": `ข้อตกลงนี้ พร้อมด้วยนโยบายความเป็นส่วนตัวและประกาศทางกฎหมายอื่น ๆ ที่เผยแพร่โดยเราเกี่ยวกับบริการ จะถือเป็นข้อตกลงทั้งหมดระหว่างคุณกับเราเกี่ยวกับบริการ หากศาลที่มีเขตอำนาจศาลถือว่าบทบัญญัติใดของข้อตกลงนี้เป็นโมฆะ การที่บทบัญญัติดังกล่าวเป็นโมฆะจะไม่ส่งผลกระทบต่อความถูกต้องของบทบัญญัติที่เหลือของข้อตกลงนี้ ซึ่งจะยังคงมีผลใช้บังคับโดยสมบูรณ์ การสละสิทธิ์ข้อกำหนดใด ๆ ของข้อตกลงนี้ไม่ถือเป็นการสละสิทธิ์เพิ่มเติมหรือต่อเนื่องของข้อกำหนดดังกล่าวหรือข้อกำหนดอื่น ๆ และความล้มเหลวของเราในการยืนยันสิทธิ์หรือข้อกำหนดใด ๆ ภายใต้ข้อตกลงนี้จะไม่ถือเป็นการสละสิทธิ์ของสิทธิ์หรือข้อกำหนดดังกล่าว คุณและเราตกลงว่าสาเหตุของการกระทำใด ๆ ที่เกิดขึ้นจากหรือเกี่ยวข้องกับบริการจะต้องเริ่มต้นภายในหนึ่ง (1) ปีหลังจากสาเหตุของการกระทำเกิดขึ้น มิฉะนั้น สาเหตุของการกระทำดังกล่าวจะถูกห้ามอย่างถาวร`,

    // Waiver
    "waiver": "สละสิทธิ์",
    "waivertxt": `ยกเว้นตามที่ระบุไว้ในที่นี้ ความล้มเหลวในการใช้สิทธิ์หรือต้องปฏิบัติตามภาระผูกพันภายใต้ข้อตกลงนี้จะไม่ส่งผลกระทบต่อความสามารถของคู่สัญญาในการใช้สิทธิ์ดังกล่าวหรือต้องปฏิบัติตามดังกล่าวในเวลาใด ๆ หลังจากนั้นและจะไม่มีการสละสิทธิ์ ของการละเมิดถือเป็นการสละสิทธิ์ของการละเมิดใด ๆ ที่ตามมา`,
    "waivertxt2": `การไม่ละเลยในการใช้ และไม่มีความล่าช้าในการดำเนินการในส่วนของฝ่ายใดฝ่ายหนึ่ง สิทธิ์ใดๆ หรืออำนาจใดๆ ภายใต้ข้อตกลงนี้จะถือเป็นการสละสิทธิหรืออำนาจนั้น การใช้สิทธิ์หรืออำนาจใด ๆ เพียงครั้งเดียวหรือบางส่วนภายใต้ข้อตกลงนี้จะไม่ขัดขวางการใช้สิทธิ์หรือสิทธิ์อื่น ๆ ที่ได้รับในที่นี้เพิ่มเติม ในกรณีที่มีข้อขัดแย้งระหว่างข้อตกลงนี้กับการซื้อหรือข้อกำหนดอื่น ๆ ที่เกี่ยวข้อง ให้ยึดข้อกำหนดของข้อตกลงนี้เป็นหลัก`,

    // Amendments to this Agreement
    "amed": "การแก้ไขข้อตกลงนี้",
    "amendtxt": `เราขอสงวนสิทธิ์ตามดุลยพินิจของตนแต่เพียงผู้เดียวในการแก้ไขหรือแทนที่ข้อตกลงนี้ได้ตลอดเวลา หากการแก้ไขมีสาระสำคัญ เราจะแจ้งให้ทราบล่วงหน้าอย่างน้อย 30 วันก่อนที่ข้อกำหนดใหม่จะมีผลใช้บังคับ สิ่งที่ถือเป็นการเปลี่ยนแปลงที่สำคัญจะถูกกำหนดตามดุลยพินิจของเราแต่เพียงผู้เดียว การเข้าถึงหรือใช้บริการของเราต่อไปหลังจากการแก้ไขมีผลบังคับใช้ แสดงว่าคุณตกลงที่จะผูกพันตามเงื่อนไขที่แก้ไข หากคุณไม่ยอมรับข้อกำหนดใหม่ คุณจะไม่ได้รับอนุญาตให้ใช้บริการของเราอีกต่อไป`,

    // Entire Agreement
    "entire": "ข้อตกลงทั้งหมด",
    "entiretxt": `ข้อตกลงนี้ประกอบด้วยข้อตกลงทั้งหมดระหว่างคุณกับเราเกี่ยวกับการใช้บริการของคุณ และมีผลแทนข้อตกลงที่เป็นลายลักษณ์อักษรหรือด้วยวาจาที่ทำขึ้นก่อนหน้านี้และในขณะเดียวกันทั้งหมดระหว่างคุณกับเรา คุณอาจอยู่ภายใต้ข้อกำหนดและเงื่อนไขเพิ่มเติมที่ใช้บังคับเมื่อคุณใช้หรือซื้อบริการอื่น ๆ จากเรา ซึ่งเราจะมอบให้แก่คุณ ณ เวลาที่มีการใช้หรือซื้อดังกล่าว`,

    // Updates to Our Terms
    "uptoteam": "อัปเดตข้อกำหนดของเรา",
    "uptoteamtxt": `เราอาจเปลี่ยนแปลงบริการและนโยบายของเรา และเราอาจจำเป็นต้องทำการเปลี่ยนแปลงข้อกำหนดเหล่านี้เพื่อให้สะท้อนถึงบริการและนโยบายของเราอย่างถูกต้อง เว้นแต่กฎหมายจะกำหนดไว้เป็นอย่างอื่น เราจะแจ้งให้คุณทราบ (เช่น ผ่านบริการของเรา) ก่อนที่เราจะเปลี่ยนแปลงข้อกำหนดเหล่านี้ และให้โอกาสคุณตรวจสอบก่อนที่จะมีผลบังคับใช้ จากนั้น หากคุณยังคงใช้บริการ คุณจะต้องผูกพันตามข้อกำหนดที่อัปเดต หากคุณไม่ต้องการยอมรับข้อกำหนดเหล่านี้หรือข้อกำหนดที่อัปเดตใดๆ คุณสามารถลบบัญชีของคุณได้`,

    // Intellectual Property
    "intell": "ทรัพย์สินทางปัญญา",
    "intelltxt": `แพลตฟอร์มของเรา ตลอดจนเนื้อหา คุณลักษณะ และฟังก์ชันการทำงานทั้งหมด (รวมถึงแต่ไม่จำกัดเพียงข้อมูล ซอฟต์แวร์ ข้อความ การแสดงผล รูปภาพ วิดีโอและเสียง ตลอดจนการออกแบบ การเลือก และการจัดเตรียม) เป็นของ โดยเรา ผู้อนุญาต หรือผู้ให้บริการอื่น ๆ ของเนื้อหาดังกล่าว และได้รับการคุ้มครองโดยกฎหมายลิขสิทธิ์ เครื่องหมายการค้า สิทธิบัตร ความลับทางการค้า และทรัพย์สินทางปัญญาหรือกรรมสิทธิ์ในทรัพย์สินของประเทศไทยและระหว่างประเทศ ห้ามคัดลอก ดัดแปลง ทำซ้ำ ดาวน์โหลด หรือแจกจ่ายเนื้อหาไม่ว่าในทางใด ๆ ทั้งหมดหรือบางส่วน โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรอย่างชัดแจ้งจากเรา เว้นแต่และยกเว้นตามที่กำหนดไว้อย่างชัดแจ้งในข้อกำหนดและเงื่อนไขเหล่านี้ ห้ามใช้วัสดุโดยไม่ได้รับอนุญาต`,

    // Agreement to Arbitrate
    "agreement": "ข้อตกลงในการอนุญาโตตุลาการ",
    "agreementtxt": `ส่วนนี้ใช้กับข้อพิพาทใดๆ ยกเว้นว่าจะไม่รวมถึงข้อพิพาทที่เกี่ยวข้องกับการเรียกร้องคำสั่งห้ามหรือการบรรเทาความเป็นธรรมเกี่ยวกับการบังคับใช้หรือความถูกต้องของสิทธิ์ในทรัพย์สินทางปัญญาของคุณหรือของคุณ คำว่า "ข้อพิพาท" หมายถึงข้อพิพาท การกระทำ หรือความขัดแย้งอื่น ๆ ระหว่างคุณกับเราเกี่ยวกับบริการหรือข้อตกลงนี้ ไม่ว่าจะอยู่ในสัญญา การรับประกัน การละเมิด กฎหมาย ข้อบังคับ กฤษฎีกา หรือพื้นฐานทางกฎหมายหรือความยุติธรรมอื่น ๆ “ข้อพิพาท” จะได้รับความหมายที่กว้างที่สุดเท่าที่จะเป็นไปได้ที่กฎหมายอนุญาต`,

    // Notice of Dispute
    "notice": "การแจ้งข้อพิพาท",
    "noticetxt": `ในกรณีเกิดข้อพิพาท คุณหรือเราต้องแจ้งข้อพิพาทแก่อีกฝ่าย ซึ่งเป็นข้อความที่เป็นลายลักษณ์อักษรที่ระบุชื่อ ที่อยู่ และข้อมูลติดต่อของฝ่ายที่แจ้ง ข้อเท็จจริงที่ก่อให้เกิดข้อพิพาท ถึงข้อพิพาทและร้องขอการบรรเทาทุกข์ คุณต้องส่งคำบอกกล่าวเกี่ยวกับข้อพิพาททางอีเมลไปที่: เราจะส่งคำบอกกล่าวเกี่ยวกับข้อพิพาทถึงคุณทางไปรษณีย์ไปยังที่อยู่ของคุณหากเรามี หรือส่งไปยังที่อยู่อีเมลของคุณ คุณและเราจะพยายามแก้ไขข้อพิพาทใดๆ ผ่านการเจรจาอย่างไม่เป็นทางการภายในหกสิบ (60) วันนับจากวันที่ส่งหนังสือแจ้งข้อพิพาท หลังจากหกสิบ (60) วัน คุณหรือเราอาจเริ่มกระบวนการอนุญาโตตุลาการได้`,

    // Binding Arbitration
    "binding": "การผูกขาดอนุญาโตตุลาการ",
    "bindingtxt": `หากคุณและเราไม่สามารถแก้ไขข้อพิพาทใดๆ ด้วยการเจรจาอย่างไม่เป็นทางการ ความพยายามอื่นใดในการแก้ไขข้อพิพาทจะดำเนินการโดยอนุญาโตตุลาการที่มีผลผูกพันตามที่อธิบายไว้ในส่วนนี้ คุณกำลังสละสิทธิ์ในการดำเนินคดี (หรือเข้าร่วมในฐานะสมาชิกพรรคหรือสมาชิกชั้นเรียน) ข้อพิพาททั้งหมดในศาลต่อหน้าผู้พิพากษาหรือคณะลูกขุน ข้อพิพาทจะได้รับการตัดสินโดยอนุญาโตตุลาการที่มีผลผูกพันตามกฎอนุญาโตตุลาการเชิงพาณิชย์ของสมาคมอนุญาโตตุลาการอเมริกัน ฝ่ายใดฝ่ายหนึ่งอาจขอคำสั่งชั่วคราวหรือคำสั่งห้ามเบื้องต้นจากศาลที่มีเขตอำนาจศาลใดๆ ตามความจำเป็นเพื่อปกป้องสิทธิ์หรือทรัพย์สินของฝ่ายที่อยู่ระหว่างการพิจารณาของอนุญาโตตุลาการ ค่าใช้จ่ายทางกฎหมาย การบัญชี และค่าใช้จ่าย ค่าธรรมเนียม และค่าใช้จ่ายอื่นๆ ทั้งหมดที่เกิดขึ้นโดยฝ่ายที่ชนะคดีจะต้องตกเป็นภาระของฝ่ายที่ไม่ชนะคดี`,

    // Submissions and Privacy
    "submiss": "การส่งและความเป็นส่วนตัว",
    "submisstxt": `ในกรณีที่คุณส่งหรือโพสต์แนวคิด คำแนะนำที่สร้างสรรค์ การออกแบบ รูปถ่าย ข้อมูล โฆษณา ข้อมูล หรือข้อเสนอ รวมถึงแนวคิดสำหรับผลิตภัณฑ์ บริการ คุณสมบัติ เทคโนโลยี หรือโปรโมชั่นใหม่หรือที่ได้รับการปรับปรุง คุณ ตกลงโดยชัดแจ้งว่าการส่งดังกล่าวจะถือว่าไม่เป็นความลับและไม่มีกรรมสิทธิ์โดยอัตโนมัติ และจะกลายเป็นทรัพย์สินของเราแต่เพียงผู้เดียวโดยไม่มีการชดเชยหรือให้เครดิตแก่คุณแต่อย่างใด เราและบริษัทในเครือของเราจะไม่มีภาระผูกพันเกี่ยวกับการส่งหรือโพสต์ดังกล่าว และอาจใช้แนวคิดที่มีอยู่ในการส่งหรือโพสต์ดังกล่าวเพื่อวัตถุประสงค์ใดๆ ในสื่อใดๆ ตลอดไป รวมถึงแต่ไม่จำกัดเพียง การพัฒนา การผลิต และการทำการตลาดผลิตภัณฑ์และบริการที่ใช้ ความคิดดังกล่าว`,

    // Typographical Errors
    "typo": "การพิมพ์ผิดพลาด",
    "typotxt": `ในกรณีที่ผลิตภัณฑ์และ/หรือบริการระบุไว้ในราคาไม่ถูกต้องหรือมีข้อมูลที่ไม่ถูกต้องเนื่องจากข้อผิดพลาดในการพิมพ์ เราจะมีสิทธิ์ที่จะปฏิเสธหรือยกเลิกคำสั่งซื้อใด ๆ ที่ทำขึ้นสำหรับผลิตภัณฑ์และ/หรือบริการที่ระบุไว้ที่ ราคาไม่ถูกต้อง เราจะมีสิทธิ์ที่จะปฏิเสธหรือยกเลิกคำสั่งซื้อดังกล่าวไม่ว่าคำสั่งซื้อจะได้รับการยืนยันและบัตรเครดิตของคุณถูกเรียกเก็บเงินหรือไม่ก็ตาม หากบัตรเครดิตของคุณถูกเรียกเก็บเงินสำหรับการซื้อแล้วและคำสั่งซื้อของคุณถูกยกเลิก เราจะออกเครดิตไปยังบัญชีบัตรเครดิตหรือบัญชีการชำระเงินอื่น ๆ ของคุณทันทีตามจำนวนที่เรียกเก็บ`,

    // Miscellaneous
    "miscel": "เบ็ดเตล็ด",
    "misceltxt": `หากศาลที่มีเขตอำนาจตัดสินพบว่าบทบัญญัติหรือส่วนใดส่วนหนึ่งของข้อกำหนดและเงื่อนไขเหล่านี้ไม่สามารถบังคับใช้ได้ ไม่ว่าด้วยเหตุผลใดก็ตาม ส่วนที่เหลือของข้อกำหนดและเงื่อนไขเหล่านี้จะยังคงมีผลใช้บังคับโดยสมบูรณ์ การสละสิทธิ์ข้อกำหนดใด ๆ ของข้อกำหนดและเงื่อนไขเหล่านี้จะมีผลเฉพาะในกรณีที่เป็นลายลักษณ์อักษรและลงนามโดยตัวแทนที่ได้รับอนุญาตจากเรา เราจะมีสิทธิ์ได้รับคำสั่งห้ามหรือการบรรเทาทุกข์อื่น ๆ ที่เป็นธรรม (โดยไม่มีภาระผูกพันในการโพสต์พันธบัตรหรือหลักประกันใด ๆ ) ในกรณีที่คุณฝ่าฝืนหรือละเมิดที่คาดการณ์ไว้ เราดำเนินการและควบคุมบริการของเราจากสำนักงานของเราในประเทศไทย บริการนี้ไม่ได้มีวัตถุประสงค์เพื่อการแจกจ่ายให้กับหรือใช้โดยบุคคลหรือนิติบุคคลใดๆ ในเขตอำนาจศาลหรือประเทศใดๆ ที่การแจกจ่ายหรือการใช้งานดังกล่าวจะขัดต่อกฎหมายหรือข้อบังคับ ดังนั้น บุคคลเหล่านั้นที่เลือกเข้าถึงบริการของเราจากสถานที่อื่น ๆ จะดำเนินการดังกล่าวด้วยความคิดริเริ่มของตนเองและมีหน้าที่รับผิดชอบในการปฏิบัติตามกฎหมายท้องถิ่นแต่เพียงผู้เดียว หากและในขอบเขตที่กฎหมายท้องถิ่นมีผลบังคับใช้ ข้อกำหนดและเงื่อนไขเหล่านี้ (ซึ่งรวมถึงและรวมเอานโยบายความเป็นส่วนตัวของเรา) ประกอบด้วยความเข้าใจทั้งหมดและแทนที่ความเข้าใจก่อนหน้านี้ทั้งหมดระหว่างคุณกับเราเกี่ยวกับเนื้อหาดังกล่าว และคุณไม่สามารถเปลี่ยนแปลงหรือแก้ไขได้ หัวข้อส่วนที่ใช้ในข้อตกลงนี้มีไว้เพื่อความสะดวกเท่านั้น และจะไม่มีการนำเข้าทางกฎหมายใดๆ`,

    // Disclaimer
    "Disclaimer": "ข้อจำกัดความรับผิดชอบ",
    "disclaimertxt": `เราจะไม่รับผิดชอบต่อเนื้อหา รหัส หรือความไม่ชัดเจนอื่นใด เราไม่ได้ให้การรับประกันหรือการค้ำประกัน ไม่ว่าในกรณีใด เราจะไม่รับผิดชอบต่อความเสียหายพิเศษ ทางตรง ทางอ้อม ที่เป็นผลสืบเนื่อง หรือโดยบังเอิญ หรือความเสียหายใด ๆ ก็ตาม ไม่ว่าจะเป็นการกระทำตามสัญญา ความประมาทเลินเล่อ หรือการละเมิดอื่น ๆ ที่เกิดขึ้นจากหรือเกี่ยวข้องกับการใช้บริการ หรือเนื้อหาของบริการ เราขอสงวนสิทธิ์ในการเพิ่ม ลบ หรือแก้ไขเนื้อหาของบริการได้ตลอดเวลาโดยไม่ต้องแจ้งให้ทราบล่วงหน้า`,

    "disclaimertxt2": `บริการของเราและเนื้อหามีให้ "ตามสภาพ" และ "ตามที่มี" โดยไม่มีการรับประกันหรือการรับรองใดๆ ไม่ว่าจะโดยชัดแจ้งหรือโดยนัย เราเป็นผู้จัดจำหน่ายและไม่ใช่ผู้เผยแพร่เนื้อหาที่จัดทำโดยบุคคลที่สาม ด้วยเหตุนี้ นักพัฒนาจึงไม่มีการควบคุมด้านบรรณาธิการสำหรับเนื้อหาดังกล่าว และไม่รับประกันหรือรับรองความถูกต้อง ความน่าเชื่อถือ หรือสกุลเงินของข้อมูล เนื้อหา บริการ หรือสินค้าใด ๆ ที่ให้ผ่านหรือเข้าถึงได้ผ่านทางบริการของเรา โดยไม่จำกัดสิ่งที่กล่าวมาข้างต้น เราขอปฏิเสธการรับประกันและการรับรองทั้งหมดในเนื้อหาใดๆ ที่ส่งผ่านหรือเกี่ยวข้องกับบริการของเราหรือบนเว็บไซต์ที่อาจปรากฏเป็นลิงก์ในบริการของเรา หรือในผลิตภัณฑ์ที่จัดให้เป็นส่วนหนึ่งของหรือเกี่ยวข้องกับ บริการของเรา รวมถึงแต่ไม่จำกัดเพียงการรับประกันความสามารถเชิงพาณิชย์ ความเหมาะสมสำหรับวัตถุประสงค์เฉพาะ หรือการไม่ละเมิดสิทธิ์ของบุคคลที่สาม ไม่มีคำแนะนำด้วยวาจาหรือข้อมูลที่เป็นลายลักษณ์อักษรจากเราหรือบริษัทในเครือ พนักงาน เจ้าหน้าที่ กรรมการ ตัวแทน หรือสิ่งที่คล้ายกันใดๆ ที่จะทำให้เกิดการรับประกัน ข้อมูลราคาและห้องว่างอาจมีการเปลี่ยนแปลงได้โดยไม่ต้องแจ้งให้ทราบ โดยไม่จำกัดสิ่งที่กล่าวมาข้างต้น เราไม่รับประกันว่าบริการของเราจะไม่มีการหยุดชะงัก ไม่เสียหาย ตรงเวลา หรือปราศจากข้อผิดพลาด`,
    // Contact Us
    "contact": "ติดต่อเรา",
    "contacttxt": "อย่าลังเลที่จะติดต่อเราหากคุณมีคำถามใดๆ",
    "contacttxt2": "ทางอีเมล: capcap241023@gmail.com"
  },

  "privacypolicypage": {
    "title": "นโยบายความเป็นส่วนตัว",
    "privacytxt": `Thai.CheckLinks ("เรา" "ของเรา" หรือ "พวกเรา") มุ่งมั่นที่จะปกป้องความเป็นส่วนตัวของคุณ นโยบายความเป็นส่วนตัวนี้อธิบายว่า Thai.CheckLinks รวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลของคุณอย่างไร นโยบายความเป็นส่วนตัวนี้ใช้กับเว็บไซต์ www.Thai.CheckLinks.com และโดเมนย่อยที่เกี่ยวข้องของเรา (เรียกรวมกันว่า "บริการ" ของเรา) การเข้าถึงหรือใช้บริการของเราแสดงว่าคุณได้อ่าน ทำความเข้าใจ และยอมรับการรวบรวม การจัดเก็บ การใช้ และการเปิดเผยข้อมูลส่วนบุคคลของคุณตามที่อธิบายไว้ในนโยบายความเป็นส่วนตัวนี้และข้อกำหนดในการให้บริการของเรา`,

    // Definitions and key terms
    "definition": "คำจำกัดความและคำศัพท์สำคัญ",
    "deftxt": `เพื่อช่วยอธิบายสิ่งต่าง ๆ ให้ชัดเจนที่สุดเท่าที่จะเป็นไปได้ในนโยบายความเป็นส่วนตัวนี้ ทุกครั้งที่มีการอ้างอิงข้อกำหนดใด ๆ เหล่านี้จะถูกกำหนดอย่างเคร่งครัดดังนี้:`,

    // Topic 1
    "topic1": "เรารวบรวมข้อมูลอะไรบ้าง",
    "topic1txt": `เรารวบรวมข้อมูลจากคุณเมื่อคุณเยี่ยมชมบริการของเรา ลงทะเบียน สมัครรับจดหมายข่าวของเรา ตอบแบบสำรวจ หรือ กรอกแบบฟอร์ม.`,
    "topic1txt2": "ชื่อ / ชื่อผู้ใช้",
    "topic1txt3": "หมายเลขโทรศัพท์",
    "topic1txt4": "ที่อยู่อีเมล",
    "topic1txt5": "รหัสผ่าน",

    // หัวข้อที่ 2
    "topic2": "เราใช้ข้อมูลที่เรารวบรวมอย่างไร",
    "topic2txt": `ข้อมูลใดๆ ที่เรารวบรวมจากคุณอาจถูกนำมาใช้ด้วยวิธีใดวิธีหนึ่งต่อไปนี้:`,
    "topic2txt2": `เพื่อปรับเปลี่ยนประสบการณ์ของคุณ (ข้อมูลของคุณช่วยให้เราสามารถตอบสนองความต้องการส่วนบุคคลของคุณได้ดียิ่งขึ้น)`,
    "topic2txt3": `เพื่อปรับปรุงบริการของเรา (เรามุ่งมั่นที่จะปรับปรุงข้อเสนอการบริการของเราอย่างต่อเนื่องตามข้อมูลและข้อเสนอแนะที่เราได้รับจากคุณ)`,
    "topic2txt4": `เพื่อปรับปรุงการบริการลูกค้า (ข้อมูลของคุณช่วยให้เราสามารถตอบสนองคำขอบริการลูกค้าและความต้องการการสนับสนุนของคุณได้อย่างมีประสิทธิภาพมากขึ้น)`,
    // หัวข้อที่ 3
    "topic3": "ข้อมูลของฉันสามารถถ่ายโอนไปยังประเทศอื่นได้หรือไม่",
    "topic3txt": `เราเป็นบริษัทที่จัดตั้งขึ้นในประเทศไทย ข้อมูลที่รวบรวมผ่านเว็บไซต์ของเรา ผ่านการโต้ตอบโดยตรงกับคุณ หรือจากการใช้บริการช่วยเหลือของเราอาจถูกถ่ายโอนเป็นครั้งคราวไปยังสำนักงานหรือบุคลากรของเรา หรือไปยังบุคคลที่สามที่ตั้งอยู่ทั่วโลก และอาจถูกดูและโฮสต์ได้ทุกที่ ในโลก รวมถึงประเทศที่อาจไม่มีกฎหมายบังคับใช้ทั่วไปที่ควบคุมการใช้และการถ่ายโอนข้อมูลดังกล่าว ตามขอบเขตสูงสุดที่กฎหมายที่ใช้บังคับอนุญาต โดยการใช้ข้อใดข้อหนึ่งข้างต้น แสดงว่าคุณยินยอมโดยสมัครใจให้มีการถ่ายโอนข้ามพรมแดนและโฮสต์ข้อมูลดังกล่าว`,

    // หัวข้อที่ 4
    "topic4": "ข้อมูลที่รวบรวมผ่านบริการของเราปลอดภัยหรือไม่",
    "topic4txt": `เราใช้ความระมัดระวังเพื่อปกป้องความปลอดภัยของข้อมูลของคุณ เรามีขั้นตอนทางกายภาพ อิเล็กทรอนิกส์ และการจัดการเพื่อช่วยปกป้อง ป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต รักษาความปลอดภัยของข้อมูล และใช้ข้อมูลของคุณอย่างถูกต้อง อย่างไรก็ตาม ทั้งบุคคลและระบบความปลอดภัยไม่สามารถเข้าใจผิดได้ รวมถึงระบบการเข้ารหัสด้วย นอกจากนี้ ผู้คนยังสามารถก่ออาชญากรรมโดยเจตนา ทำผิดพลาด หรือไม่ปฏิบัติตามนโยบายได้ ดังนั้น แม้ว่าเราจะใช้ความพยายามตามสมควรในการปกป้องข้อมูลส่วนบุคคลของคุณ แต่เราไม่สามารถรับประกันความปลอดภัยได้อย่างสมบูรณ์ หากกฎหมายที่บังคับใช้กำหนดหน้าที่ที่ไม่ปฏิเสธความรับผิดชอบในการปกป้องข้อมูลส่วนบุคคลของคุณ คุณยอมรับว่าการประพฤติมิชอบโดยเจตนาจะเป็นมาตรฐานที่ใช้ในการวัดการปฏิบัติตามหน้าที่นั้นของเรา`,

    // หัวข้อที่ 5
    "topic5": "ฉันสามารถอัปเดตหรือแก้ไขข้อมูลของฉันได้หรือไม่",
    "topic5txt": "แน่นอน! คุณสามารถอัปเดตข้อมูลของคุณผ่านทางหน้าโปรไฟล์ได้",

    // หัวข้อที่ 6
    "topic6": "เราจะเก็บข้อมูลของคุณไว้นานแค่ไหน",
    "topic6txt": `เราเก็บข้อมูลของคุณตราบเท่าที่เราต้องการเพื่อให้บริการแก่คุณและบรรลุวัตถุประสงค์ที่อธิบายไว้ในนโยบายนี้ นี่เป็นกรณีของใครก็ตามที่เราแบ่งปันข้อมูลของคุณด้วยและผู้ให้บริการในนามของเรา เมื่อเราไม่จำเป็นต้องใช้ข้อมูลของคุณอีกต่อไป และไม่จำเป็นต้องเก็บรักษาข้อมูลดังกล่าวเพื่อให้เป็นไปตามภาระผูกพันทางกฎหมายหรือข้อบังคับของเรา เราจะลบข้อมูลดังกล่าวออกจากระบบของเราหรือลดความเป็นส่วนบุคคล เพื่อให้เราไม่สามารถระบุตัวตนของคุณได้`,

    // หัวข้อที่ 7
    "topic7": "กฎหมายที่ใช้บังคับ",
    "topic7txt": `กฎหมายของประเทศไทย ไม่รวมความขัดแย้งของกฎเกณฑ์ทางกฎหมาย จะควบคุมข้อตกลงนี้และการใช้บริการของเรา การใช้บริการของเราอาจอยู่ภายใต้กฎหมายท้องถิ่น รัฐ ประเทศ หรือระหว่างประเทศอื่นๆ`,

    // หัวข้อที่ 8
    "topic8": "ความยินยอมของคุณ",
    "topic8txt": `การใช้บริการของเรา การลงทะเบียนบัญชี แสดงว่าคุณยินยอมต่อนโยบายความเป็นส่วนตัวนี้`,

    // หัวข้อ 9 คุกกี้
    "topic9": "คุกกี้",
    "topic9txt": `เราใช้ "คุกกี้" เพื่อระบุพื้นที่ของเว็บไซต์ของเราที่คุณเคยเยี่ยมชม คุกกี้คือข้อมูลชิ้นเล็กๆ ที่เว็บเบราว์เซอร์ของคุณจัดเก็บไว้ในคอมพิวเตอร์หรืออุปกรณ์มือถือของคุณ เราใช้คุกกี้เพื่อปรับแต่งเนื้อหาที่คุณเห็นบนเว็บไซต์ของเรา เว็บเบราว์เซอร์ส่วนใหญ่สามารถตั้งค่าให้ปิดการใช้งานคุกกี้ได้ อย่างไรก็ตาม หากคุณปิดการใช้งานคุกกี้ คุณอาจไม่สามารถเข้าถึงฟังก์ชันการทำงานบนเว็บไซต์ของเราได้อย่างถูกต้องหรือไม่ได้เลย เราไม่เคยใส่ข้อมูลที่สามารถระบุตัวบุคคลได้ในคุกกี้ `,

    // หัวข้อที่ 10
    "topic10": "ความเป็นส่วนตัวของเด็ก",
    "topic10txt": `เราไม่กล่าวถึงใครก็ตามที่มีอายุต่ำกว่า 13 ปี เราจะไม่รวบรวมข้อมูลที่สามารถระบุตัวตนส่วนบุคคลจากใครก็ตามที่มีอายุต่ำกว่า 13 ปีโดยเจตนา หากคุณเป็นพ่อแม่หรือผู้ปกครอง และคุณรับทราบว่าบุตรหลานของคุณได้ให้ข้อมูลแก่เรา ข้อมูลส่วนบุคคลโปรดติดต่อเรา หากเราทราบว่าเราได้รวบรวมข้อมูลส่วนบุคคลจากใครก็ตามที่มีอายุต่ำกว่า 13 ปีโดยไม่ได้รับการตรวจสอบความยินยอมจากผู้ปกครอง เราจะดำเนินการเพื่อลบข้อมูลนั้นออกจากเซิร์ฟเวอร์ของเรา`,

    // หัวข้อที่ 11
    "topic11": "การเปลี่ยนแปลงนโยบายความเป็นส่วนตัวของเรา",
    "topic11txt": `หากเราตัดสินใจเปลี่ยนแปลงนโยบายความเป็นส่วนตัว เราจะโพสต์การเปลี่ยนแปลงเหล่านั้นบนหน้านี้ และ/หรืออัปเดตวันที่แก้ไขนโยบายความเป็นส่วนตัวด้านล่าง`,

    // หัวข้อที่ 12
    "topic12": "เทคโนโลยีการติดตาม",
    "topic12txt": "คุกกี้",
    "topic12txt2": `เราใช้คุกกี้เพื่อปรับปรุงประสิทธิภาพและการทำงานของบริการของเรา แต่ไม่จำเป็นต่อการใช้งาน อย่างไรก็ตาม หากไม่มีคุกกี้เหล่านี้ ฟังก์ชันบางอย่างเช่นวิดีโออาจไม่พร้อมใช้งานหรือคุณจะต้องป้อนรายละเอียดการเข้าสู่ระบบทุกครั้งที่คุณเยี่ยมชมบริการของเรา เนื่องจากเราจะจำไม่ได้ว่าคุณเคยเข้าสู่ระบบก่อนหน้านี้`,
    "topic12txt3": "ที่เก็บข้อมูลในเครื่อง",
    "topic12txt4": `พื้นที่จัดเก็บในตัวเครื่องซึ่งบางครั้งเรียกว่าพื้นที่จัดเก็บ DOM มอบวิธีการและโปรโตคอลสำหรับจัดเก็บข้อมูลฝั่งไคลเอ็นต์ให้กับเว็บแอป ที่เก็บข้อมูลบนเว็บรองรับการจัดเก็บข้อมูลถาวร คล้ายกับคุกกี้ แต่มีความจุที่เพิ่มขึ้นอย่างมาก และไม่มีข้อมูลที่จัดเก็บไว้ในส่วนหัวของคำขอ HTTP`,
    "topic12txt5": "เซสชัน",
    "topic12txt6": `ใช้ "เซสชัน" เพื่อระบุพื้นที่ของเว็บไซต์ของเราที่คุณเคยเยี่ยมชม เซสชันคือข้อมูลชิ้นเล็กๆ ที่เว็บเบราว์เซอร์ของคุณจัดเก็บไว้ในคอมพิวเตอร์หรืออุปกรณ์เคลื่อนที่ของคุณ`,

    // หัวข้อที่ 13
    "topic13": "ข้อมูลเกี่ยวกับพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล (PDPA) ของประเทศไทย",
    "topic13txt": `เราอาจรวบรวมและใช้ข้อมูลจากคุณหากคุณอยู่ในประเทศไทย และในนโยบายความเป็นส่วนตัวในส่วนนี้ เราจะอธิบายอย่างชัดเจนว่าทำไมและถึงข้อมูลนี้จึงถูกรวบรวม และวิธีที่เรารักษาข้อมูลนี้ภายใต้ ป้องกันการทำซ้ำหรือใช้ในทางที่ผิด`,

    // หัวข้อที่ 14
    "topic14": "PDPA คืออะไร",
    "topic14txt": `PDPA เป็นกฎหมายความเป็นส่วนตัวและการคุ้มครองข้อมูลที่ครอบคลุมในประเทศไทย ซึ่งควบคุมวิธีที่บริษัทปกป้องข้อมูลของแต่ละบุคคล และปรับปรุงการควบคุมที่บุคคลมีต่อข้อมูลส่วนบุคคลของตน`,

    // หัวข้อที่ 15
    "topic15": "ข้อมูลส่วนบุคคลคืออะไร",
    "topic15txt": `ข้อมูลส่วนบุคคลตามที่กำหนดโดย PDPA หมายถึงข้อมูลใดๆ ที่เกี่ยวข้องกับบุคคลที่สามารถระบุตัวตนได้ PDPA ครอบคลุมข้อมูลที่หลากหลายซึ่งสามารถใช้เพื่อระบุตัวบุคคล ไม่ว่าจะโดยลำพังหรือใช้ร่วมกับข้อมูลอื่นๆ ตัวอย่างรวมถึงแต่ไม่จำกัดเพียง ชื่อ รายละเอียดการติดต่อ ข้อมูลทางการเงิน ข้อมูลไบโอเมตริกซ์ ที่อยู่ IP และอื่นๆ`,
    "topic15txt2": `หลักการคุ้มครองข้อมูลที่ระบุไว้ใน PDPA รวมถึงข้อกำหนดต่างๆ เช่น:`,
    "topic15txt3": `ข้อมูลส่วนบุคคลที่รวบรวมจะต้องได้รับการประมวลผลด้วยวิธีที่ยุติธรรม ถูกกฎหมาย และโปร่งใส และควรใช้ในลักษณะที่บุคคลคาดหวังอย่างสมเหตุสมผลเท่านั้น`,
    "topic15txt4": `ข้อมูลส่วนบุคคลควรได้รับการรวบรวมเพื่อให้บรรลุวัตถุประสงค์เฉพาะเท่านั้น และควรใช้เพื่อวัตถุประสงค์นั้นเท่านั้น องค์กรต้องระบุว่าเหตุใดจึงต้องการข้อมูลส่วนบุคคลเมื่อเก็บรวบรวม`,
    "topic15txt5": `ข้อมูลส่วนบุคคลควรถูกเก็บไว้ไม่เกินความจำเป็นเพื่อให้บรรลุวัตถุประสงค์`,
    "topic15txt6": `บุคคลที่ได้รับการคุ้มครองโดย PDPA มีสิทธิ์ในการเข้าถึงข้อมูลส่วนบุคคลของตนเอง พวกเขายังสามารถขอสำเนาข้อมูลของตนได้ และขอให้อัปเดต ลบ จำกัด หรือถ่ายโอนข้อมูลไปยังองค์กรอื่น`,

    // หัวข้อที่ 16
    "topic16": "เหตุใด PDPA จึงมีความสำคัญ",
    "topic16txt": `PDPA แนะนำข้อกำหนดใหม่เกี่ยวกับวิธีที่บริษัทควรปกป้องข้อมูลส่วนบุคคลของบุคคลที่พวกเขารวบรวมและประมวลผล โดยเน้นการปฏิบัติตามผ่านการบังคับใช้ที่เพิ่มขึ้นและกำหนดบทลงโทษสำหรับการละเมิด นอกเหนือจากข้อกำหนดทางกฎหมายเหล่านี้ เราเชื่อว่าการเคารพความเป็นส่วนตัวของข้อมูลเป็นสิ่งสำคัญ ที่ Thai.CheckLinks เรามีแนวปฏิบัติด้านความปลอดภัยและความเป็นส่วนตัวที่เข้มงวดซึ่งนอกเหนือไปจากกฎระเบียบ PDPA`,

    // หัวข้อที่ 17
    "topic17": `สิทธิ์ของเจ้าของข้อมูลส่วนบุคคล - การเข้าถึงข้อมูล ความสามารถในการพกพา และการลบ`,
    "topic17txt": `เรามุ่งมั่นที่จะช่วยเหลือลูกค้าของเราให้ปฏิบัติตามข้อกำหนดสิทธิ์ของเจ้าของข้อมูลของ PDPA Thai.CheckLinks.com ประมวลผลหรือจัดเก็บข้อมูลส่วนบุคคลทั้งหมดไว้ในผู้จำหน่ายที่ได้รับการตรวจสอบอย่างครบถ้วนและปฏิบัติตาม PDPA เราเก็บรักษาการสนทนาและข้อมูลส่วนบุคคลทั้งหมดไว้สูงสุดปี 2024 เว้นแต่บัญชีของคุณจะถูกลบ ในกรณีเช่นนี้ เราจะกำจัดข้อมูลทั้งหมดตามข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัวของเรา แต่เราจะไม่เก็บไว้นานกว่าปี 2025`,
    "topic17txt2": `เรารับทราบถึงความสำคัญของการให้บุคคลสามารถเข้าถึง อัปเดต เรียกคืน และลบข้อมูลส่วนบุคคลได้ เราได้ออกแบบระบบของเราให้เป็นบริการตนเองตั้งแต่เริ่มต้น เพื่อให้มั่นใจว่าคุณสามารถเข้าถึงข้อมูลของคุณและข้อมูลของลูกค้าได้ ทีมสนับสนุนลูกค้าของเราพร้อมให้ความช่วยเหลือคุณในทุกคำถามที่คุณอาจมีเกี่ยวกับการทำงานร่วมกับ PDPA`,
  },

  "homepage": {
    "title": "เริ่มต้นตรวจสอบลิงค์เว็บไซต์ เพื่อความปลอดภัยของคุณ",
    "caption": "ใส่ลิงค์ของคุณในช่องตรวจสอบ เพื่อตรวจสอบเว็บไซต์ที่คุณใช้ และเพื่อเช็คเปอร์เซ็นความเป็นเว็บไซต์มิจฉาชีพเทียบกับฐานข้อมูลประวัติอาชญากรรม",
    "text": "ค้นหาลิงค์ URL หรือ ประเภทเว็บไซต์",
    "verify": "ตรวจสอบ",
    "rank": "จัดอันดับลิงค์มิจฉาชีพ",
    "detail": "รายละเอียด",
    "category": "ประเภท",
    "reportnum": "จำนวนการแจ้ง",
    "more": "ข้อมูลเพิ่มเติม",
    "searchbutt": "ค้นหา",
    "filter": "ตัวกรอง",
    "alldefault": "ค่าเริ่มต้นทั้งหมด",
    "date": "วันเวลา",
    "old": "วันที่เก่าที่สุด",
    "new": "วันที่ล่าสุด",
    "report": "จำนวนรายงาน",
    "high": "จำนวนรายงานสูงสุด",
    "low": "จำนวนรายงานต่ำสุด",
    "gambling": "เว็บพนัน",
    "scam": "หลอกลวง",
    "fake": "ปลอมแปลง",
    "others": "อื่นๆ",
    "seemore": "ดูเพิ่มเติม",
    "seeall": "ดูทั้งหมด",
    "seeless": "ดูน้อยลง",
    "placeholder": "ใส่ลิงค์ ตัวอย่าง. https://www.example.com ...",
    "sort": "ตัวกรองลำดับ"
  },

  "detailpage": {
    "title": "รายละเอียดเว็บไซต์อาชญากรรม",
    "category": "ประเภท",
    "gambling": "พนัน",
    "scam": "หลอกลวง",
    "fake": "ปลอมแปลง",
    "others": "อื่นๆ",
    "gamblingr": "พนัน รายงาน",
    "scamr": "หลอกลวง รายงาน",
    "faker": "ปลอมแปลง รายงาน",
    "othersr": "อื่นๆ รายงาน",
    "searchtext": "ค้นหาคำ",
    "searchbutt": "ค้นหา",
    "detail": "รายละเอียด",
    "bank": "บัญชีธนาคาร",
    "more": "ดูเพิ่มเติม",
    "seemore": "ดูเพิ่มเติม",
    "seeall": "ดูทั้งหมด",
    "seeless": "ดูน้อยลง",
    "user": "ผู้แจ้งรายที่",
    "phone": "เบอร์โทร"
  },

  "report": {
    "title": "เริ่มต้นรายงานลิงค์เว็บไซต์ต้องสงสัย",
    "caption": "กรุณา Sign in หรือ Sign up ก่อนการรายงานข้อมูล เพื่อความแม่นยำของข้อมูลของคุณ",
    "caption2": "คุณสามารถรายงานลิงค์ต้องสงสัยได้ที่นี้ เพื่อให้ข้อมูลที่เป็นประโยชน์ต่อการตรวจสอบเว็บอาชญากรรม",
    "signin": "เข้าสู่ระบบ",
    "signup": "ลงทะเบียน",
    "placeholder": "ใส่ลิงค์ ตัวอย่าง. https://www.example.com ...",
    "searchbutt": "ยืนยัน",
    "Category": "ประเภทของลิงค์ต้องสงสัย*",
    "typefield": "เลือกประเภท",
    "moredetails": "เว็บไซต์นี้มีความเสี่ยงอย่างไร*",
    "details": "รายละเอียด (อย่างน้อย 10 ตัวอักษรและไม่เกิน 500 ตัวอักษร)",
    "bankacc": "ข้อมูลธนาคารและหมายเลขโทรศัพท์ของอาชญากร (ทางเลือก)",
    "bankacctxt": "บัญชีธนาคาร:",
    "banktext": "ชื่อเจ้าของบัญชี (หากมีหลายบัญชีเลือกเพียง 1 บัญชี)",
    "bankfield1": "บัญชีธนาคาร",
    "banknum": "เลขที่บัญชี",
    "phonenumtxt": "เบอร์โทรติดต่อ:",
    "phonenum": "เบอร์โทรติดต่อ",
    "reportbutt": "รายงาน",
    "gambling": "เว็บพนัน",
    "scam": "หลอกลวง",
    "fake": "ปลอมแปลง",
    "others": "อื่นๆ",
    "bank": "ธนาคาร",
    "scb": "ธนาคารไทยพาณิช",
    "kbtg": "ธนาคารกสิกรไทย",
    "ktb": "ธนาคารกรุงไทย",
    "ttb": "ธนาคารทหารไทยธนชาติ",
    "boa": "ธนาคารกรุงศรีอยุธยา",
    "lhb": "ธนาคารแลนด์แอนด์เฮาส์",
    "gsb": "ธนาคารออมสิน",
    "bankothers": "อื่นๆ",
    "urlError": "กรุณากรอก URL",
    "urlError2": "กรุณากรอกรูปแบบของ URL ให้ถูกต้อง",
    "urlError3": "URL มีตัวอักษรที่ไม่ถูกต้อง",
    "webCatError": "โปรดเลือกประเภทของเว็บไซต์!",
    "moredetailError": "โปรดกรอกข้อมูลเกี่ยวกับเว็บไซต์เพิ่มเติม!",
    "moredetailError2": "โปรดตรวจสอบให้แน่ใจว่ารายละเอียดของคุณมีอักขระระหว่าง 10 ถึง 500 ตัว",
    "moredetailError3": "กรุณาไม่ใช้คำซ้ำซ้อนเกิน 3 ครั้ง",
  },

  "reportsuccess": {
    "title": "รายงานลิงค์เว็บไซต์สำเร็จ",
    "sub-title": "ขอบคุณที่รายงานลิงค์ที่นี้",
    "sub-title2": "เราจะใช้ประโยชน์ต่อการตรวจสอบเว็บอาชญากรรมเพื่อช่วยเหลือส่วนรวมต่อไป",
    "successmess": "รายงานสำเร็จ"
  },

  "profilepage": {
    "title": "โปรไฟล์ของฉัน",
    "caption": "ลงชื่อเข้าใช้ หรือ ลงทะเบียนก่อนดูข้อมูลโปรไฟล์ของคุณ",
    "username": "ชื่อผู้ใช้",
    "email": "Email",
    "phonenum": "เบอร์ติดต่อ (ทางเลือก)",
    "password": "รหัสผ่าน",
  },

  "verificationpage": {
    "title": "เริ่มต้นตรวจสอบลิงค์เว็บไซต์ เพื่อความปลอดภัยของคุณ",
    "caption": "ใส่ลิงค์ของคุณในช่องตรวจสอบ เพื่อตรวจสอบเว็บไซต์ที่คุณใช้และเพื่อเช็คเปอร์เซ็นความเป็นเว็บไซต์มิจฉาชีพเทียบกับฐานข้อมูลประวัติอาชญากรรม",
    "url-detection-title": "ตรวจสอบ URL",
    "No Result": "ไม่มีผลลัพธ์ดังกล่าว",
    "cannotclassify": "เนื่องจากข้อมูลไม่เพียงพอ",
    "report": "รายงาน",

    "overall-title": "ภาพรวมความเสี่ยงของเป็นเว็บไซต์",
    "overall-subtitle": "เปอร์เซ็นต์ความเสี่ยงที่จะเป็นเว็บไซต์อันตรายอ้างอิงจากเกณฑ์ทั้งหมด",
    "risk-value": "ค่าความเสี่ยง",
    "sum-percentage": "เปอร์เซ็นต์ผลรวม",
    "low-score": "ความเสี่ยงต่ำ",
    "quite-low-score": "ความเสี่ยงค่อนข้างต่ำ",
    "quite-high-score": "ความเสี่ยงค่อนข้างสูง",
    "high-score": "ความเสี่ยงสูง",
    'risk-measurement-citeria': "เกณฑ์การวัดความเสี่ยง",
    "found-thai-scam-link": "ค้นพบในประวัติการรายงานเว็บไซต์ใน Thai.CheckLinks",
    "found-ai": "ค้นพบ AI ตรวจสอบเปอร์เซ็นต์ความเสี่ยง",
    "url-measure": "ความเสี่ยงของ URL วัดจาก URL Detection",
    "found-other-database": "ค้นพบในเว็บไซต์ตรวจสอบเว็บโกงอื่นๆ",
    "seemore": "ดูเพิ่มเติม",
    "click-here": "คลิกที่นี่หากต้องการรายงานเพิ่มเติม",

    "analysis-title": "AI ตรวจสอบเปอร์เซ็นความเสี่ยง",
    "analysis-subtitle": "ค่าเปอร์เซ็นมากสุดที่เคยวิเคราะห์ได้",
    "see-overview": "กลับไปดูที่ภาพรวม",

    'readmore': "อ่านรายละเอียดเว็บไซต์เพิ่มเติมที่นี่",
    'malicious-url': "Malicious URL Detection",

    "gambling-label": "พนัน",
    "scam-label": "หลอกลงทุน",
    "fake-label": "ปลอมแปลง",
    "other-label": "อื่นๆ",

    'update': 'อัพเดทล่าสุด',
    'analysis-most': "วิเคราะห์เป็นเว็บ",

    "report-title": "ตรวจสอบจากฐานข้อมูล",
    "report-subtitle": "ตรวจสอบเว็บไซต์กับฐานข้อมูลการรายงานผู้ใช้ใน Thai.ScamLinks",
    "report-title-result": "ผลการตรวจสอบ",
    "risk-title-count": "อัตราความเสี่ยงจากจำนวนรายงาน",

    "low-risk-count": "ความเสี่ยงต่ำมี 0-5 รายงาน",
    "moderate-risk-count": "ความเสี่ยงปานกลางมี 6-10 รายงาน",
    "quite-high-risk-count": "ความเสี่ยงค่อนข้างสูงมี 11-15 รายงาน",
    "serious-risk-count": "ความเสี่ยงอันตรายมี 16 รายงาน",

    "low-count": "ต่ำ",
    "quite-low-count": "ค่อนข้างต่ำ",
    "quite-high-count": "ค่อนข้างอันตราย",
    "high-count": "อันตราย",

    "gambling": "พนัน",
    "scam": "หลอกลงทุน",
    "fake": "ปลอมแปลง",
    "other": "อื่นๆ",

    'report-found': 'มีข้อมูลในฐานข้อมูล',
    'report-not-found': 'ไม่มีข้อมูลในฐานข้อมูล',
    'report-not-found2': 'พบว่าเป็นประเภทอื่นๆในฐานข้อมูล',

    'report-most': "ส่วนใหญ่แจ้งเป็นเว็บ",
    'report-unit': "คน",

    "report-label-bar-plot": "จำนวนการรีพอร์ตในแต่ละประเภท",

    "measure-title": "ตรวจสอบจาก URL Detection",
    "measure-subtitle": "ตรวจสอบความเสี่ยงของเว็บไซต์จาก URL",
    "measure-risk-title": "ความเสี่ยง",

    "API-title": "เปรียบเทียบ API กับเว็บไซต์ตรวจสอบเว็บโกงอื่นๆ",
    "API-subtitle": "ตรวจสอบเว็บไซต์กับฐานข้อมูลเว็บไซต์ตรวจสอบอื่นๆ",
    "API-website-col": "เว็บไซต์ตรวจสอบเว็บโกง",
    "API-inspection-result-col": "ผลการตรวจสอบ",
    "FOUND": "ค้นพบ",
    "NOT FOUND": "ไม่พบ",
  },

  "moredetailpage": {
    "title": "รายละเอียด URL เพิ่มเติม",
    "risk-score": "เปอร์เซ็นความเสี่ยง:",
    "measurement": "เกณฑ์การวัดความน่าเชื่อถือ",
    "websiteinsight-title": "ข้อมูลเชิงลึกของเว็บไซต์",
    "API-title": "เปรียบเทียบ API กับเว็บไซต์ตรวจสอบเว็บโกงอื่นๆ",
    "API-website-col": "เว็บไซต์ตรวจสอบเว็บโกง",
    "API-inspection-result-col": "ผลการตรวจสอบ",
    "FOUND": "ค้นพบ",
    "NOT FOUND": "ไม่พบ",
    "No Result": "ไม่มีผลลัพธ์ดังกล่าว",
    'positive': 'ข้อดี',
    'negative': 'ข้อเสีย'
  },

  "errormessage": {
    "errmessuserexist": "มีผู้ใช้ที่ใช้ชื่อผู้ใช้นี้อยู่แล้ว",
    "errmessemailexist": "มีผู้ใช้ที่ใช้อีเมลนี้อยู่แล้ว",
    "errmessphoneexist": "มีผู้ใช้ที่ใช้เบอร์โทรศัพท์นี้อยู่แล้ว",
    "errmesspassword": "คุณไม่สามารถเปลี่ยนรหัสผ่านด้วยรหัสผ่านเก่าของคุณได้",
    "editnoinfo": "ต้องการข้อมูลสำหรับการอัพเดต",
    "editerrinfo": "มีบางอย่างผิดปกติกับข้อมูลของคุณ",
    "editsuccess": "แก้ไขข้อมูลผู้ใช้สำเร็จ",
    "usersuccess": "สร้างข้อมูลผู้ใช้สำเร็จแล้ว",
    "errsigninusername": "ไม่มีชื่อผู้ใช้ที่ระบุ กรุณาลงทะเบียนหากคุณไม่มีบัญชี",
    "errsigninpassword": "รหัสผ่านไม่ถูกต้อง",
    "errnoinfosignin": "โปรดระบุชื่อผู้ใช้หรือรหัสผ่านของคุณ",
    "errsigninsystem": "โปรดลองลงชื่อเข้าใช้หรือรหัสผ่านอีกครั้งให้ครบถ้วน",
    "signinsuccess": "ลงชื่อเข้าใช้สำเร็จ",
    "reporterrwebsiteinact": "เว็บไซต์นี้อาจใช้งานไม่ได้แล้ว จึงไม่สามารถแสดงค่าความเสี่ยงโดยรวมและค่า AI Classify ได้",
    "reportsuccess": "สร้างข้อมูลรายงานสำเร็จแล้ว",
    "errurl1": "ไม่สามารถยืนยันเว็บไซต์นี้ได้ แต่ผู้ใช้ยังสามารถรายงานเว็บไซต์นี้ได้",
    "errurl2": "โปรดตรวจสอบการเชื่อมต่อ machine learning แต่ผู้ใช้ยังสามารถรายงานเว็บไซต์นี้ได้",
    "caution": "คำเตือน",
  }
}